# total=[100,200,300,200,300]
# male=[50,100,130,100,130]

mon={'8~10시':{'전체인구':20,'30대 남자':20},
'10~12시':{'전체인구':50,'30대 남자':10},
'12~14시':{'전체인구':10,'30대 남자':10},
'14~16시':{'전체인구':40,'30대 남자':20},
'16~18시':{'전체인구':30,'30대 남자':10},
'18~20시':{'전체인구':20,'30대 남자':5},
'20~22시':{'전체인구':20,'30대 남자':2}}
# Tue={'8~10시':40,'10~12시':50,'12~14시':80,'14시~16시':100,'16시~18시':92,'18시~20시':50,'20시~22시':49}
# Wen={'8~10시':40,'10~12시':50,'12~14시':80,'14시~16시':100,'16시~18시':92,'18시~20시':50,'20시~22시':49}
# Thr={'8~10시':40,'10~12시':50,'12~14시':80,'14시~16시':100,'16시~18시':92,'18시~20시':50,'20시~22시':49}
# Fri={'8~10시':40,'10~12시':50,'12~14시':80,'14시~16시':100,'16시~18시':92,'18시~20시':50,'20시~22시':49}

print(mon['8~10시']['전체인구'])

# people={
#     '월요일':{f"전체 인구:{total[0]}",f"30대 남성:{male[0]}"},
#     '화요일':{f"전체 인구:{total[1]}",f"30대 남성:{male[1]}"},
#     '수요일':{f"전체 인구:{total[2]}",f"30대 남성:{male[2]}"},
#     '목요일':{f"전체 인구:{total[3]}",f"30대 남성:{male[3]}"},
#     '금요일':{f"전체 인구:{total[4]}",f"30대 남성:{male[4]}"},
# }

# totalpeople=sum(total)
# totalave=float(totalpeople/len(total))

# totalmale=sum(male)
# totalmaleave=float(sum(male)/len(male))

# print(f"월~금 전체 유동인구는{totalpeople}명이고 평균은{totalave}명 이다. 월~금 30대 남자 유동인구는{totalmale}명이고 평균은 {totalmaleave}이다\n")